# Preppin' Data 2023 W02

source: https://preppindata.blogspot.com/2023/01/2023-week-2-international-bank-account.html

### Load files

In [1]:
import pandas as pd

In [2]:
df_cd = pd.read_csv('Swift Codes.csv')
df_txn = pd.read_csv('Transactions.csv')

In [3]:
df_cd.head()

            Bank SWIFT code Check Digits
0    Lloyds Bank       LOYD           C1
1  Barclays Bank       BARC           22
2        Halifax       HLFX           22
3           HSBC       HBUK           4B
4        Natwest       NWBK           2L

In [4]:
df_txn.head()

   Transaction ID  Account Number Sort Code              Bank
0            3888        62230725  95-98-82  Data Source Bank
1            4746        83172326  42-86-38     Barclays Bank
2            5404        34302539  53-28-21     Barclays Bank
3            9013        13350031  93-87-71           Natwest
4            2535        68745993  57-14-32     Barclays Bank

### Replace hyphen in Sort Code

In [9]:
df_txn['Sort Code'] = df_txn['Sort Code'].str.replace('-','')

In [10]:
df_txn.head()

   Transaction ID  Account Number Sort Code              Bank
0            3888        62230725    959882  Data Source Bank
1            4746        83172326    428638     Barclays Bank
2            5404        34302539    532821     Barclays Bank
3            9013        13350031    938771           Natwest
4            2535        68745993    571432     Barclays Bank

### Join tables

In [19]:
df = df_txn.merge(df_cd, how='left', on='Bank')

In [21]:
df

,Transaction ID,Account Number,Sort Code,Bank,SWIFT code,Check Digits
0,3888,62230725,959882,Data Source Bank,DSBX,12
1,4746,83172326,428638,Barclays Bank,BARC,22
2,5404,34302539,532821,Barclays Bank,BARC,22
3,9013,13350031,938771,Natwest,NWBK,2L
4,2535,68745993,571432,Barclays Bank,BARC,22
...,...,...,...,...,...,...
95,9373,44568613,241512,HSBC,HBUK,4B
96,2021,72261023,591751,Lloyds Bank,LOYD,C1
97,6764,10570182,297239,Data Source Bank,DSBX,12
98,3286,47326725,218530,Halifax,HLFX,22
99,7423,75616805,493126,Halifax,HLFX,22

### Add a country field

In [24]:
df['Country'] = 'GB'

In [25]:
df.head()

,Transaction ID,Account Number,Sort Code,Bank,SWIFT code,Check Digits,Country
0,3888,62230725,959882,Data Source Bank,DSBX,12,GB
1,4746,83172326,428638,Barclays Bank,BARC,22,GB
2,5404,34302539,532821,Barclays Bank,BARC,22,GB
3,9013,13350031,938771,Natwest,NWBK,2L,GB
4,2535,68745993,571432,Barclays Bank,BARC,22,GB

### Create IBAN code

In [36]:
df['IBAN'] = df['Country'] + df['SWIFT code'] + df['Check Digits'] + df['Sort Code'].astype(str) \
+ df['Account Number'].astype(str)

### Check results

In [37]:
df.head()

,Transaction ID,Account Number,Sort Code,Bank,SWIFT code,Check Digits,Country,IBAN
0,3888,62230725,959882,Data Source Bank,DSBX,12,GB,GBDSBX1295988262230725
1,4746,83172326,428638,Barclays Bank,BARC,22,GB,GBBARC2242863883172326
2,5404,34302539,532821,Barclays Bank,BARC,22,GB,GBBARC2253282134302539
3,9013,13350031,938771,Natwest,NWBK,2L,GB,GBNWBK2L93877113350031
4,2535,68745993,571432,Barclays Bank,BARC,22,GB,GBBARC2257143268745993

### Remove fields and export

In [40]:
df = df[['Transaction ID','IBAN']]

In [41]:
df.head()

   Transaction ID                    IBAN
0            3888  GBDSBX1295988262230725
1            4746  GBBARC2242863883172326
2            5404  GBBARC2253282134302539
3            9013  GBNWBK2L93877113350031
4            2535  GBBARC2257143268745993

In [43]:
df.to_csv('2023W02_output.csv', index=False)